Белгипрозем_2017/src/Documents/ВедомостьАктирования/ВедомостьАктирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьАктирования</name>
  <registerRecords>AccumulationRegister.НачислениеЗП</registerRecords>
  <registerRecords>AccumulationRegister.УчетДоговоров</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАкта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаАкта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Зарплата</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент понижающий или повышающий</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеКоэффициента</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/InformationRegisters/СвязиДокументов/СвязиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвязиДокументов</name>
  <resources>
    <name>СвязанныйДокументОтправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСвязи</name>
    <type>
      <types>CatalogRef.ТипыСвязей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязанныйДокумент</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ВходящееСообщениеСВД</types>
      <types>DocumentRef.ИсходящееСообщениеСВД</types>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвязаннаяСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьСвязанныйДокумент</name>
    <type>
      <types>CatalogRef.ШаблоныИсходящихДокументов</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>String</types>
      <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ШаблоныВходящихДокументов</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/AccumulationRegisters/УчетДоговоров/УчетДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетДоговоров</name>
  <resources>
    <name>Сумма</name>
    <comment>Сумма с НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.мСтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсвобождениеОтНДС</name>
    <type>
      <types>CatalogRef.мОсвобождениеОтНДС</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Белгипрозем_2017/src/AccumulationRegisters/РасчетыСПокупателями/РасчетыСПокупателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПокупателями</name>
  <resources>
    <name>Сумма</name>
    <comment>Сумма с НДС</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <comment>Дата расчетного документа</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзаимозачета</name>
    <type>
      <types>EnumRef.мВидыВзаимозачета</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПлатежа</name>
    <type>
      <types>CatalogRef.мСпособыПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСписанияЗадолженности</name>
    <type>
      <types>EnumRef.мВидыСписанияЗадолженности</types>
    </type>
  </attributes>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Белгипрозем_2017/src/Documents/ВедомостьАктирования/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьАкты(Команда)
    Если Не ОчиститьТабЧасть(Объект.Акты, "Акты") Тогда
        Возврат;   
	КонецЕсли; 
	
	Если Объект.Проведен Тогда
		ТекстПредупреждения = НСтр("ru='Для правильного заполнения таблицы надо отменить проведение документа. Продолжить?'");
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(ТекстПредупреждения, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
		ОтменитьПроведениеДокумента(); 
	КонецЕсли; 
	
	ЗаполнитьАктыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАктыНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсходящиеДокументыПолучатели.Получатель КАК Корреспондент,
		|	СвязиДокументов1.Документ КАК Договор,
		|	ЭтапыДоговоров.Ссылка КАК ЭтапДоговора,
		|	УчетДоговоровОстатки.СуммаОстаток КАК Сумма,
		|	УчетДоговоровОстатки.НДСОстаток КАК НДС,
		|	ЭтапыДоговоров.Подразделение,
		|	РасчетыСПокупателямиОбороты.СуммаПриход КАК Оплата
		|ИЗ
		|	Справочник.ИсходящиеДокументы.Получатели КАК ИсходящиеДокументыПолучатели
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвязиДокументов КАК СвязиДокументов
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВнутренниеДокументы.ДополнительныеРеквизиты КАК ВнутренниеДокументыДополнительныеРеквизиты
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвязиДокументов КАК СвязиДокументов1
		|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.мЭтапыДоговоров КАК ЭтапыДоговоров
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.УчетДоговоров.Остатки(&ДатаСреза, ) КАК УчетДоговоровОстатки
		|						ПО ЭтапыДоговоров.Ссылка = УчетДоговоровОстатки.ЭтапДоговора
		|						ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПокупателями.Обороты КАК РасчетыСПокупателямиОбороты
		|						ПО ЭтапыДоговоров.Ссылка = РасчетыСПокупателямиОбороты.ЭтапДоговора
		|					ПО СвязиДокументов1.Документ.Ссылка = ЭтапыДоговоров.Владелец
		|				ПО ВнутренниеДокументыДополнительныеРеквизиты.Ссылка = СвязиДокументов1.СвязанныйДокумент.Ссылка
		|			ПО СвязиДокументов.Документ.Ссылка = ВнутренниеДокументыДополнительныеРеквизиты.Ссылка
		|		ПО ИсходящиеДокументыПолучатели.Ссылка = СвязиДокументов.СвязанныйДокумент.Ссылка
		|ГДЕ
		|	ИсходящиеДокументыПолучатели.Ссылка.ВидДокумента.Наименование = ""Расписка в получении""
		|	И СвязиДокументов.Документ.ВидДокумента.Наименование = ""Дело""
		|	И ВнутренниеДокументыДополнительныеРеквизиты.Свойство.Наименование = ""Этап договора""
		|	И ЭтапыДоговоров.НомерЭтапа = ВнутренниеДокументыДополнительныеРеквизиты.Значение
		|	И УчетДоговоровОстатки.СуммаОстаток > 0";

	Запрос.УстановитьПараметр("ДатаСреза", Объект.Дата);

	Результат = Запрос.Выполнить().Выгрузить();

	Для каждого СтрокаТЗ Из Результат Цикл
		ТекущаяСтрока = Объект.Акты.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТЗ);
		ТекущаяСтрока.НомерАкта = ТекущаяСтрока.Договор.РегистрационныйНомер + "/" + ТекущаяСтрока.ЭтапДоговора.НомерЭтапа;
	КонецЦикла;
	
	РаскраситьТаблицу();

КонецПроцедуры // ЗаполнитьАктыНаСервере()

&НаКлиенте
Функция ОчиститьТабЧасть(ТабЧасть, ИмяТЧ)
	Если ТабЧасть.Количество() > 0 Тогда
		ТекстПредупреждения = НСтр("ru='В документе будет очищена таблица %ПредставлениеТабличнойЧасти%. Продолжить выполнение операции?'");
		ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "%ПредставлениеТабличнойЧасти%", ИмяТЧ);
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Вопрос(ТекстПредупреждения, Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат Ложь;
		КонецЕсли;
		ТабЧасть.Очистить();
	КонецЕсли;	
                          
    Возврат Истина;
КонецФункции // ОчиститьТабЧасть()

&НаСервере
Функция ОтменитьПроведениеДокумента()
	
	ДокОбъект = Объект.Ссылка.ПолучитьОбъект();
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Объект.Ссылка, ДокОбъект.ДополнительныеСвойства);
	ДокОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", Ложь);
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ДокОбъект);
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ДокОбъект);
    ДокОбъект.Проведен = Ложь;
	
КонецФункции 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РаскраситьТаблицу();
КонецПроцедуры

&НаСервере
Процедура РаскраситьТаблицу()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Акты.Сумма");
	ЭлементУсловия.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Акты.Оплата");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	
	ОформляемыеПоля = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("АктыНомерСтроки");
	ОформляемыеПоля = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("АктыСумма");
	ОформляемыеПоля = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("АктыОплата");
	ОформляемыеПоля = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("АктыДатаАкта");
	ОформляемыеПоля = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("АктыНомерАкта");
	ОформляемыеПоля = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("АктыКорреспондент");
	ОформляемыеПоля = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("АктыДоговор");
	ОформляемыеПоля = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("АктыЭтапДоговора");
	ОформляемыеПоля = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных("АктыПодразделение");

КонецПроцедуры // РаскраситьТаблицу()

&НаКлиенте
Процедура АктыСуммаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Акты.ТекущиеДанные;
	ТекущаяСтрока.НДС = РассчитатьНДС(ТекущаяСтрока.ЭтапДоговора, ТекущаяСтрока.Сумма);
КонецПроцедуры

// Расчет суммы НДС от всего
&НаСервереБезКонтекста
Функция РассчитатьНДС(ЭтапДоговора, Сумма)
	Ставка = ЭтапДоговора.СтавкаНДС.Ставка;
	Возврат Сумма * Ставка / (100 + Ставка);
КонецФункции // 

&НаКлиенте
Процедура АктыПриАктивизацииСтроки(Элемент)
	ПоказатьЗарплатуИсполнителейЭтапа(Элемент);
КонецПроцедуры

// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ПоказатьЗарплатуИсполнителейЭтапа(Элемент)
	СтруктураОтбор = Новый ФиксированнаяСтруктура("ЭтапДоговора", "@#$*");
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ЭтапДоговора) Тогда
			СтруктураОтбор = Новый ФиксированнаяСтруктура("ЭтапДоговора", Элемент.ТекущиеДанные.ЭтапДоговора);
		КонецЕсли;
	КонецЕсли; 
	
	Элементы.Зарплата.ОтборСтрок = СтруктураОтбор;
КонецПроцедуры // ПоказатьИсполнителейЭтапа(Элемент)

&НаКлиенте
Процедура АктыПослеУдаления(Элемент)
    УдалитьЗарплатуЛишнихИсполнителейЭтапов();
КонецПроцедуры
 
 &НаСервере
Процедура УдалитьЗарплатуЛишнихИсполнителейЭтапов()
	
	Для й = -Объект.Зарплата.Количество() + 1 По 0 Цикл
		Отбор = Новый Структура("ЭтапДоговора", Объект.Зарплата[-й].ЭтапДоговора);
		НайденныеСтроки = Объект.Акты.НайтиСтроки(Отбор);
		Если  НайденныеСтроки.Количество() = 0 Тогда
			Объект.Зарплата.Удалить(-й);
		КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры // УдалитьЛишнихИсполнителейЭтапов()

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры
